#include <bits/stdc++.h>
using namespace std;
string s;
int a[10000], b[10000];
int main() {
  cin >> s;
  // 把 s[s.size() - 1 - i] 转换成数值。
  for (int i = 0; i < s.size(); i++) {
    a[i] = s[s.size() - 1 - i] - '0';
  }
  for (int i = 0; i * 4 < s.size(); i++) {
    int sum = a[i * 4] + a[i * 4 + 1] * 8 + a[i * 4 + 2] * 64 + a[i * 4 + 3] * 512;
    b[i * 3] = sum % 16, b[i * 3 + 1] = sum / 16 % 16, b[i * 3 + 2] = sum / 256;
  }
  int i = 9999;
  for (; i > 0 && !b[i]; i--) {
  }
  for (; i >= 0; i--) {
    cout << char((b[i] < 10 ? b[i] + '0' : 'a' + b[i] - 10));  // 这里要强制转换成 char 类型，因为没写强制转换 char 类型就会输出 ASCII 码值。
  }
  return 0;
}
// cin >> s1;
// for (int i = 0; i <= 31; i++) {
//       w[i] = pow(2, i);
// }
//   cin >> s1;
//   for (int i = 0; i <= 31; i++) {
//     w[i] = pow(2, i);
//   }
//   // 这里要把八进制转换成十进制。
//   for (int i = stoi(s1); i > 0; i /= 2) {
//     s2 += i % 2 + '0';
//   }
//   for (; s2.size() % 4 != 0; s2 += '0') {
//   }
//   for (int i = 0; i < s2.size(); i++) {
//     ans[i / 4] += (s2[i] - '0') * w[i % 4];
//     if (i % 4 == 3) {
//       ans[i / 4] %= 16;
//       if (i / 4 + 1 < 1000) {
//         ans[i / 4 + 1] += ans[i / 4] / 16;
//       }
//     }
//   }
//   int i = 999;
//   for (; i > 0 && !ans[i]; i--) {
//   }
//   for (; i >= 0; i--) {
//     cout << (ans[i] < 10 ? ans[i] : 'a' + ans[i] - 10);
//   }
// for (long long i = stoll(s1); i > 0; i /= 2) {
//   s2 += i % 2 + '0';
// }
// for (int i = 0; i <= 30; i++) {
//   ans[i] += w[i] * b[i];
//   ans[i + 1] += ans[i] / 16;
// }
// int i = 999;
// for (; i > 0 && !ans[i]; i--) {
// }
// for (; i >= 0; i--) {
//   cout << (ans[i] >= 10 ? 'a' + ans[i] - 10 : ans[i]);
// }

/*

# B3617 古籍翻译

## 题目描述

机器猫跑到外星人的图书馆去读书。有一本外星古籍，里面的内容是用八进制写成的；但机器猫只能处理十六进制的数据。请你帮忙写一个翻译软件，帮机器猫把八进制串翻译成十六进制串。

其中十六进制中的 $10$ 至 $15$ 使用小写字母 $\text{a}$ 至 $\text{f}$ 表示。

## 输入格式

仅一行，一个八进制字符串 $s$，表示古籍内容。

## 输出格式

仅一行，一个十六进制字符串，表示翻译结果。

## 输入输出样例 #1

### 输入 #1

```

144

```

### 输出 #1

```

64

```

## 输入输出样例 #2

### 输入 #2

```

1572061125

```

### 输出 #2

```

de86255

```

## 说明/提示

#### 样例解释

第一组样例：八进制 `144` 即十进制下的 100，其十六进制表示为 `64`。

第二组样例：八进制 `1572061125` 即十进制下的 233333333，其十六进制表示为 `de86255`。

#### 数据规模与约定

对于 $40\%$ 的数据，有 $|s| \leq 10$，即输入字符串**长度**不超过 $10$。

对于 $100\%$ 的数据，有 $|s| \leq 1000$，即输入字符串**长度**不超过 $1000$。

*/